ingestion-api/perf/wrk2/output/2015-03-17-v0.1.0s-perf-100-events-output.txt
# Running on laptop
#  - 2.6GHz Quad-core Intel Core i7, 16GB 1600MHz DDR3L SDRAM
#  - wrk2 v3.1.1 (https://github.com/giltene/wrk2)
#  - wrk -t5 -c100 -d50s -R2000 --latency -s $1 http://127.0.0.1:9000/v1/events
#  - ingestion-api v0.1.0 on host (no docker)
#  -  {:server {:port 9000 :auto-reload true}
#      :backend {:type :kafka :topic "events" :metadata.broker.list "192.168.59.103:49154"}}
#  - kafka v0.8.2.1 backend with 3 brokers in docker
#  - 1 topic 1 partition

Running 50s test @ http://127.0.0.1:9000/v1/events
  5 threads and 100 connections
  Thread calibration: mean lat.: 5228.369ms, rate sampling interval: 16703ms
  Thread calibration: mean lat.: 5239.034ms, rate sampling interval: 16736ms
  Thread calibration: mean lat.: 5253.243ms, rate sampling interval: 16744ms
  Thread calibration: mean lat.: 5243.115ms, rate sampling interval: 16752ms
  Thread calibration: mean lat.: 5231.078ms, rate sampling interval: 16728ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    27.09s     7.70s   38.34s    72.47%
    Req/Sec    42.60     16.40    59.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   28.00s
 75.000%   32.93s
 90.000%   36.14s
 99.000%   38.21s
 99.900%   38.37s
 99.990%   38.37s
 99.999%   38.37s
100.000%   38.37s

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    8978.431     0.000000            2         1.00
   11026.431     0.100000          722         1.11
   22691.839     0.200000         1446         1.25
   24395.775     0.300000         2168         1.43
   26116.095     0.400000         2890         1.67
   28000.255     0.500000         3614         2.00
   28901.375     0.550000         3971         2.22
   29851.647     0.600000         4334         2.50
   30785.535     0.650000         4696         2.86
   31768.575     0.700000         5054         3.33
   32931.839     0.750000         5414         4.00
   33439.743     0.775000         5598         4.44
   33947.647     0.800000         5786         5.00
   34439.167     0.825000         5966         5.71
   35061.759     0.850000         6144         6.67
   35618.815     0.875000         6320         8.00
   35880.959     0.887500         6406         8.89
   36143.103     0.900000         6498        10.00
   36438.015     0.912500         6598        11.43
   36732.927     0.925000         6682        13.33
   36995.071     0.937500         6770        16.00
   37191.679     0.943750         6814        17.78
   37355.519     0.950000         6864        20.00
   37486.591     0.956250         6904        22.86
   37617.663     0.962500         6948        26.67
   37748.735     0.968750         6996        32.00
   37814.271     0.971875         7016        35.56
   37879.807     0.975000         7042        40.00
   37945.343     0.978125         7066        45.71
   38010.879     0.981250         7092        53.33
   38076.415     0.984375         7116        64.00
   38109.183     0.985938         7128        71.11
   38109.183     0.987500         7128        80.00
   38207.487     0.989062         7155        91.43
   38207.487     0.990625         7155       106.67
   38240.255     0.992188         7164       128.00
   38273.023     0.992969         7181       142.22
   38273.023     0.993750         7181       160.00
   38273.023     0.994531         7181       182.86
   38305.791     0.995313         7196       213.33
   38305.791     0.996094         7196       256.00
   38305.791     0.996484         7196       284.44
   38305.791     0.996875         7196       320.00
   38338.559     0.997266         7206       365.71
   38338.559     0.997656         7206       426.67
   38338.559     0.998047         7206       512.00
   38338.559     0.998242         7206       568.89
   38371.327     0.998437         7218       640.00
   38371.327     1.000000         7218          inf
#[Mean    =    27092.094, StdDeviation   =     7704.073]
#[Max     =    38338.560, Total count    =         7218]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9438 requests in 50.17s, 0.89MB read
  Socket errors: connect 0, read 0, write 0, timeout 700
Requests/sec:    188.13
Transfer/sec:     18.19KB